cambio a structurzr
